{
  "backend/main.mo": "Main backend actor implementing user profiles, timetable CRUD, and payment settings with access control checks.",
  "backend/migration.mo": "Migration module that initializes empty maps and default payment settings for upgrading actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, hooks, and pages.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "Basic HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router setup with all public and admin routes wrapped in session guards and shared layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders an access denied message with a button to return to the dashboard.",
  "frontend/src/components/AppLayout.tsx": "Provides the main app layout with header, back button, logout, and footer around page content.",
  "frontend/src/components/RequireSession.tsx": "Session guard component that redirects unauthenticated users and shows a loading state during initialization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and helpers for managing Internet Identity authentication and loading stored identities.",
  "frontend/src/hooks/useLocalSession.ts": "Implements simple name/password session storage in localStorage with login and logout helpers.",
  "frontend/src/hooks/usePaymentSettings.ts": "Fetches and updates payment settings through the backend actor, converting between backend and UPI formats.",
  "frontend/src/hooks/useTimetable.ts": "Loads and saves timetable lessons via the backend actor, handling time parsing and formatting.",
  "frontend/src/index.css": "Defines Tailwind base, component, and utility layers with custom theme variables and dark mode styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/admin/PaymentSettingsPage.tsx": "Admin-only page to view and update UPI payment settings with validation and save handling.",
  "frontend/src/pages/admin/TimetableEditorPage.tsx": "Admin-only timetable editor that loads entries, allows adding/removing/editing rows, validates fields, and saves via mutation. Includes admin check and UI for managing schedule data.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Renders a static announcements list with styled cards.",
  "frontend/src/pages/ContactTeacherPage.tsx": "Provides a WhatsApp contact button with fallback handling if the window cannot open.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login form that stores name/password in local session and redirects to the dashboard.",
  "frontend/src/pages/NotesPage.tsx": "Displays a list of notes and shows a toast saying the file is unavailable when clicked.",
  "frontend/src/pages/PayFeesPage.tsx": "Handles UPI fee payments with amount validation, UPI link generation, and fallback behavior.",
  "frontend/src/pages/StudentDashboardPage.tsx": "Renders student dashboard with navigation cards linking to major app sections.",
  "frontend/src/pages/TeacherAdminPage.tsx": "Provides admin action buttons for teachers, with some features disabled as coming soon.",
  "frontend/src/pages/TimetablePage.tsx": "Fetches and displays the class timetable with colored schedule cards and loading/empty states.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters (including hash), storing/retrieving them in sessionStorage, and clearing them for persisted state like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, container settings, animations, and theme tokens for the frontend UI.",
  "project_state.json": "Metadata describing the project state, existing features, architecture notes, and planned behavior for the tuition classes app."
}